[NoCoverage] BlockStatement
src/utils/date.ts:1:80
-export function formatDate(date: Date | string, format = 'YYYY-MM-DD'): string {
-  const d = typeof date === 'string' ? new Date(date) : date;
-
-  const year = d.getFullYear();
-  const month = String(d.getMonth() + 1).padStart(2, '0');
-  const day = String(d.getDate()).padStart(2, '0');
-  const hours = String(d.getHours()).padStart(2, '0');
-  const minutes = String(d.getMinutes()).padStart(2, '0');
-  const seconds = String(d.getSeconds()).padStart(2, '0');
-
-  return format
-    .replace('YYYY', String(year))
-    .replace('MM', month)
-    .replace('DD', day)
-    .replace('HH', hours)
-    .replace('mm', minutes)
-    .replace('ss', seconds);
-}
+export function formatDate(date: Date | string, format = 'YYYY-MM-DD'): string {}
 
 export function formatRelativeTime(date: Date | string): string {

[NoCoverage] StringLiteral
src/utils/date.ts:1:58
-export function formatDate(date: Date | string, format = 'YYYY-MM-DD'): string {
+export function formatDate(date: Date | string, format = ""): string {
   const d = typeof date === 'string' ? new Date(date) : date;
 

[NoCoverage] ConditionalExpression
src/utils/date.ts:2:13
 export function formatDate(date: Date | string, format = 'YYYY-MM-DD'): string {
-  const d = typeof date === 'string' ? new Date(date) : date;
+  const d = false ? new Date(date) : date;
 
   const year = d.getFullYear();

[NoCoverage] EqualityOperator
src/utils/date.ts:2:13
 export function formatDate(date: Date | string, format = 'YYYY-MM-DD'): string {
-  const d = typeof date === 'string' ? new Date(date) : date;
+  const d = typeof date !== 'string' ? new Date(date) : date;
 
   const year = d.getFullYear();

[NoCoverage] StringLiteral
src/utils/date.ts:17:14
     .replace('DD', day)
     .replace('HH', hours)
     .replace('mm', minutes)
-    .replace('ss', seconds);
+    .replace("", seconds);
 }
 

[NoCoverage] BlockStatement
src/utils/date.ts:20:65
     .replace('ss', seconds);
 }
 
-export function formatRelativeTime(date: Date | string): string {
-  const d = typeof date === 'string' ? new Date(date) : date;
-  const now = new Date();
-  const diffMs = now.getTime() - d.getTime();
-  const diffSec = Math.floor(diffMs / 1000);
-  const diffMin = Math.floor(diffSec / 60);
-  const diffHour = Math.floor(diffMin / 60);
-  const diffDay = Math.floor(diffHour / 24);
-
-  if (diffSec < 60) {
-    return `${diffSec}秒前`;
-  }
-  if (diffMin < 60) {
-    return `${diffMin}分钟前`;
-  }
-  if (diffHour < 24) {
-    return `${diffHour}小时前`;
-  }
-  if (diffDay < 7) {
-    return `${diffDay}天前`;
-  }
-  return formatDate(d, 'YYYY-MM-DD');
-}
+export function formatRelativeTime(date: Date | string): string {}
 
 export function parseDate(dateStr: string): Date {

[NoCoverage] ConditionalExpression
src/utils/date.ts:21:13
 }
 
 export function formatRelativeTime(date: Date | string): string {
-  const d = typeof date === 'string' ? new Date(date) : date;
+  const d = false ? new Date(date) : date;
   const now = new Date();
   const diffMs = now.getTime() - d.getTime();

[NoCoverage] EqualityOperator
src/utils/date.ts:21:13
 }
 
 export function formatRelativeTime(date: Date | string): string {
-  const d = typeof date === 'string' ? new Date(date) : date;
+  const d = typeof date !== 'string' ? new Date(date) : date;
   const now = new Date();
   const diffMs = now.getTime() - d.getTime();

[NoCoverage] ArithmeticOperator
src/utils/date.ts:23:18
 export function formatRelativeTime(date: Date | string): string {
   const d = typeof date === 'string' ? new Date(date) : date;
   const now = new Date();
-  const diffMs = now.getTime() - d.getTime();
+  const diffMs = now.getTime() + d.getTime();
   const diffSec = Math.floor(diffMs / 1000);
   const diffMin = Math.floor(diffSec / 60);

[NoCoverage] ArithmeticOperator
src/utils/date.ts:24:30
   const d = typeof date === 'string' ? new Date(date) : date;
   const now = new Date();
   const diffMs = now.getTime() - d.getTime();
-  const diffSec = Math.floor(diffMs / 1000);
+  const diffSec = Math.floor(diffMs * 1000);
   const diffMin = Math.floor(diffSec / 60);
   const diffHour = Math.floor(diffMin / 60);

[NoCoverage] ArithmeticOperator
src/utils/date.ts:25:30
   const now = new Date();
   const diffMs = now.getTime() - d.getTime();
   const diffSec = Math.floor(diffMs / 1000);
-  const diffMin = Math.floor(diffSec / 60);
+  const diffMin = Math.floor(diffSec * 60);
   const diffHour = Math.floor(diffMin / 60);
   const diffDay = Math.floor(diffHour / 24);

[NoCoverage] ArithmeticOperator
src/utils/date.ts:26:31
   const diffMs = now.getTime() - d.getTime();
   const diffSec = Math.floor(diffMs / 1000);
   const diffMin = Math.floor(diffSec / 60);
-  const diffHour = Math.floor(diffMin / 60);
+  const diffHour = Math.floor(diffMin * 60);
   const diffDay = Math.floor(diffHour / 24);
 

[NoCoverage] ArithmeticOperator
src/utils/date.ts:27:30
   const diffSec = Math.floor(diffMs / 1000);
   const diffMin = Math.floor(diffSec / 60);
   const diffHour = Math.floor(diffMin / 60);
-  const diffDay = Math.floor(diffHour / 24);
+  const diffDay = Math.floor(diffHour * 24);
 
   if (diffSec < 60) {

[NoCoverage] ConditionalExpression
src/utils/date.ts:29:7
   const diffHour = Math.floor(diffMin / 60);
   const diffDay = Math.floor(diffHour / 24);
 
-  if (diffSec < 60) {
+  if (false) {
     return `${diffSec}秒前`;
   }

[NoCoverage] BlockStatement
src/utils/date.ts:29:21
   const diffHour = Math.floor(diffMin / 60);
   const diffDay = Math.floor(diffHour / 24);
 
-  if (diffSec < 60) {
-    return `${diffSec}秒前`;
-  }
+  if (diffSec < 60) {}
   if (diffMin < 60) {
     return `${diffMin}分钟前`;

[NoCoverage] StringLiteral
src/utils/date.ts:30:12
   const diffDay = Math.floor(diffHour / 24);
 
   if (diffSec < 60) {
-    return `${diffSec}秒前`;
+    return ``;
   }
   if (diffMin < 60) {

[NoCoverage] ConditionalExpression
src/utils/date.ts:32:7
   if (diffSec < 60) {
     return `${diffSec}秒前`;
   }
-  if (diffMin < 60) {
+  if (false) {
     return `${diffMin}分钟前`;
   }

[NoCoverage] EqualityOperator
src/utils/date.ts:32:7
   if (diffSec < 60) {
     return `${diffSec}秒前`;
   }
-  if (diffMin < 60) {
+  if (diffMin >= 60) {
     return `${diffMin}分钟前`;
   }

[NoCoverage] StringLiteral
src/utils/date.ts:33:12
     return `${diffSec}秒前`;
   }
   if (diffMin < 60) {
-    return `${diffMin}分钟前`;
+    return ``;
   }
   if (diffHour < 24) {

[NoCoverage] EqualityOperator
src/utils/date.ts:35:7
   if (diffMin < 60) {
     return `${diffMin}分钟前`;
   }
-  if (diffHour < 24) {
+  if (diffHour <= 24) {
     return `${diffHour}小时前`;
   }

[NoCoverage] BlockStatement
src/utils/date.ts:35:22
   if (diffMin < 60) {
     return `${diffMin}分钟前`;
   }
-  if (diffHour < 24) {
-    return `${diffHour}小时前`;
-  }
+  if (diffHour < 24) {}
   if (diffDay < 7) {
     return `${diffDay}天前`;

[NoCoverage] StringLiteral
src/utils/date.ts:36:12
     return `${diffMin}分钟前`;
   }
   if (diffHour < 24) {
-    return `${diffHour}小时前`;
+    return ``;
   }
   if (diffDay < 7) {

[NoCoverage] ConditionalExpression
src/utils/date.ts:38:7
   if (diffHour < 24) {
     return `${diffHour}小时前`;
   }
-  if (diffDay < 7) {
+  if (true) {
     return `${diffDay}天前`;
   }

[NoCoverage] ConditionalExpression
src/utils/date.ts:38:7
   if (diffHour < 24) {
     return `${diffHour}小时前`;
   }
-  if (diffDay < 7) {
+  if (false) {
     return `${diffDay}天前`;
   }

[NoCoverage] StringLiteral
src/utils/date.ts:39:12
     return `${diffHour}小时前`;
   }
   if (diffDay < 7) {
-    return `${diffDay}天前`;
+    return ``;
   }
   return formatDate(d, 'YYYY-MM-DD');

[NoCoverage] BlockStatement
src/utils/date.ts:44:50
   return formatDate(d, 'YYYY-MM-DD');
 }
 
-export function parseDate(dateStr: string): Date {
-  return new Date(dateStr);
-}
+export function parseDate(dateStr: string): Date {}
 
 export function isToday(date: Date | string): boolean {

[NoCoverage] BlockStatement
src/utils/date.ts:48:55
   return new Date(dateStr);
 }
 
-export function isToday(date: Date | string): boolean {
-  const d = typeof date === 'string' ? new Date(date) : date;
-  const today = new Date();
-  return (
-    d.getDate() === today.getDate() &&
-    d.getMonth() === today.getMonth() &&
-    d.getFullYear() === today.getFullYear()
-  );
-}
+export function isToday(date: Date | string): boolean {}
 
 export function addDays(date: Date, days: number): Date {

[NoCoverage] ConditionalExpression
src/utils/date.ts:49:13
 }
 
 export function isToday(date: Date | string): boolean {
-  const d = typeof date === 'string' ? new Date(date) : date;
+  const d = false ? new Date(date) : date;
   const today = new Date();
   return (

[NoCoverage] EqualityOperator
src/utils/date.ts:49:13
 }
 
 export function isToday(date: Date | string): boolean {
-  const d = typeof date === 'string' ? new Date(date) : date;
+  const d = typeof date !== 'string' ? new Date(date) : date;
   const today = new Date();
   return (

[NoCoverage] LogicalOperator
src/utils/date.ts:52:5
   const d = typeof date === 'string' ? new Date(date) : date;
   const today = new Date();
   return (
-    d.getDate() === today.getDate() &&
-    d.getMonth() === today.getMonth() &&
-    d.getFullYear() === today.getFullYear()
+    d.getDate() === today.getDate() && d.getMonth() === today.getMonth() || d.getFullYear() === today.getFullYear()
   );
 }

[NoCoverage] EqualityOperator
src/utils/date.ts:52:5
   const d = typeof date === 'string' ? new Date(date) : date;
   const today = new Date();
   return (
-    d.getDate() === today.getDate() &&
+    d.getDate() !== today.getDate() &&
     d.getMonth() === today.getMonth() &&
     d.getFullYear() === today.getFullYear()

[NoCoverage] EqualityOperator
src/utils/date.ts:53:5
   const today = new Date();
   return (
     d.getDate() === today.getDate() &&
-    d.getMonth() === today.getMonth() &&
+    d.getMonth() !== today.getMonth() &&
     d.getFullYear() === today.getFullYear()
   );

[NoCoverage] ConditionalExpression
src/utils/date.ts:53:5
   const today = new Date();
   return (
     d.getDate() === today.getDate() &&
-    d.getMonth() === today.getMonth() &&
+    true &&
     d.getFullYear() === today.getFullYear()
   );

[NoCoverage] EqualityOperator
src/utils/date.ts:54:5
   return (
     d.getDate() === today.getDate() &&
     d.getMonth() === today.getMonth() &&
-    d.getFullYear() === today.getFullYear()
+    d.getFullYear() !== today.getFullYear()
   );
 }

[NoCoverage] ConditionalExpression
src/utils/date.ts:54:5
   return (
     d.getDate() === today.getDate() &&
     d.getMonth() === today.getMonth() &&
-    d.getFullYear() === today.getFullYear()
+    true
   );
 }

[NoCoverage] BlockStatement
src/utils/date.ts:58:57
   );
 }
 
-export function addDays(date: Date, days: number): Date {
-  const result = new Date(date);
-  result.setDate(result.getDate() + days);
-  return result;
-}
+export function addDays(date: Date, days: number): Date {}
 

[NoCoverage] MethodExpression
src/utils/date.ts:60:3
 
 export function addDays(date: Date, days: number): Date {
   const result = new Date(date);
-  result.setDate(result.getDate() + days);
+  result.setTime(result.getDate() + days);
   return result;
 }

[NoCoverage] ArithmeticOperator
src/utils/date.ts:60:18
 
 export function addDays(date: Date, days: number): Date {
   const result = new Date(date);
-  result.setDate(result.getDate() + days);
+  result.setDate(result.getDate() - days);
   return result;
 }
