[Survived] StringLiteral
src/services/asr.service.ts:3:21
 import { error, info } from '../utils/logger.js';
 
-const ASR_API_URL = 'https://dashscope.aliyuncs.com/api/v1/services/audio/asr/transcription';
+const ASR_API_URL = "";
 
 interface ASRResult {

[Killed] EqualityOperator
src/services/asr.service.ts:14:18
 export async function transcribeAudio(audioUrl: string): Promise<ASRResult> {
   const apiKey = process.env.FUN_ASR_API_KEY;
 
-  if (!apiKey || apiKey === 'your-fun-asr-api-key') {
+  if (!apiKey || apiKey !== 'your-fun-asr-api-key') {
     return { text: '', success: false, error: 'API key not configured' };
   }
killedBy: ASR Service transcribeAudio should return error when API key not configured
statusReason: expected 'ASR API error: 401' to be 'API key not configured' // Object.is equality

[Killed] ConditionalExpression
src/services/asr.service.ts:14:18
 export async function transcribeAudio(audioUrl: string): Promise<ASRResult> {
   const apiKey = process.env.FUN_ASR_API_KEY;
 
-  if (!apiKey || apiKey === 'your-fun-asr-api-key') {
+  if (!apiKey || false) {
     return { text: '', success: false, error: 'API key not configured' };
   }
killedBy: ASR Service transcribeAudio should return error when API key not configured
statusReason: expected 'ASR API error: 401' to be 'API key not configured' // Object.is equality

[Killed] BooleanLiteral
src/services/asr.service.ts:15:33
   const apiKey = process.env.FUN_ASR_API_KEY;
 
   if (!apiKey || apiKey === 'your-fun-asr-api-key') {
-    return { text: '', success: false, error: 'API key not configured' };
+    return { text: '', success: true, error: 'API key not configured' };
   }
 
killedBy: ASR Service transcribeAudio should return error when API key not configured
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/services/asr.service.ts:19:47
   }
 
   try {
-    const response = await fetch(ASR_API_URL, {
-      method: 'POST',
-      headers: {
-        Authorization: `Bearer ${apiKey}`,
-        'Content-Type': 'application/json',
-      },
-      body: JSON.stringify({
-        model: 'paraformer-v2',
-        file_urls: [audioUrl],
-      }),
-      signal: AbortSignal.timeout(30000),
-    });
+    const response = await fetch(ASR_API_URL, {});
 
     if (!response.ok) {
killedBy: ASR Service transcribeAudio should send correct request body
statusReason: expected undefined to be 'POST' // Object.is equality

[Killed] StringLiteral
src/services/asr.service.ts:20:15
 
   try {
     const response = await fetch(ASR_API_URL, {
-      method: 'POST',
+      method: "",
       headers: {
         Authorization: `Bearer ${apiKey}`,
killedBy: ASR Service transcribeAudio should send correct request body
statusReason: expected '' to be 'POST' // Object.is equality

[Killed] BooleanLiteral
src/services/asr.service.ts:35:35
     if (!response.ok) {
       const errMsg = `ASR API error: ${response.status}`;
       error(errMsg);
-      return { text: '', success: false, error: errMsg };
+      return { text: '', success: true, error: errMsg };
     }
 
killedBy: ASR Service transcribeAudio should return error when API returns non-ok status
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/services/asr.service.ts:35:14
     if (!response.ok) {
       const errMsg = `ASR API error: ${response.status}`;
       error(errMsg);
-      return { text: '', success: false, error: errMsg };
+      return {};
     }
 
killedBy: ASR Service transcribeAudio should return error when API returns non-ok status
statusReason: expected undefined to be false // Object.is equality

[Killed] OptionalChaining
src/services/asr.service.ts:41:18
     const data = (await response.json()) as {
       data?: { results?: Array<{ transcription?: { text?: string } }> };
     };
-    const text = data?.data?.results?.[0]?.transcription?.text || '';
+    const text = data?.data?.results[0]?.transcription?.text || '';
 
     info('ASR transcription completed', { textLength: text.length });
killedBy: ASR Service transcribeAudio should handle missing results array
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/services/asr.service.ts:41:18
     const data = (await response.json()) as {
       data?: { results?: Array<{ transcription?: { text?: string } }> };
     };
-    const text = data?.data?.results?.[0]?.transcription?.text || '';
+    const text = data?.data?.results?.[0]?.transcription.text || '';
 
     info('ASR transcription completed', { textLength: text.length });
killedBy: ASR Service transcribeAudio should handle missing transcription text
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/services/asr.service.ts:43:10
     };
     const text = data?.data?.results?.[0]?.transcription?.text || '';
 
-    info('ASR transcription completed', { textLength: text.length });
+    info("", { textLength: text.length });
     return { text, success: true };
   } catch (e) {

[Survived] ObjectLiteral
src/services/asr.service.ts:43:41
     };
     const text = data?.data?.results?.[0]?.transcription?.text || '';
 
-    info('ASR transcription completed', { textLength: text.length });
+    info('ASR transcription completed', {});
     return { text, success: true };
   } catch (e) {

[Killed] BooleanLiteral
src/services/asr.service.ts:44:29
     const text = data?.data?.results?.[0]?.transcription?.text || '';
 
     info('ASR transcription completed', { textLength: text.length });
-    return { text, success: true };
+    return { text, success: false };
   } catch (e) {
     const errMsg = e instanceof Error ? e.message : 'Unknown ASR error';
killedBy: ASR Service transcribeAudio should return success with transcription text
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/services/asr.service.ts:44:12
     const text = data?.data?.results?.[0]?.transcription?.text || '';
 
     info('ASR transcription completed', { textLength: text.length });
-    return { text, success: true };
+    return {};
   } catch (e) {
     const errMsg = e instanceof Error ? e.message : 'Unknown ASR error';
killedBy: ASR Service transcribeAudio should return success with transcription text
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/services/asr.service.ts:45:15
 
     info('ASR transcription completed', { textLength: text.length });
     return { text, success: true };
-  } catch (e) {
-    const errMsg = e instanceof Error ? e.message : 'Unknown ASR error';
-    error('ASR transcription failed', { error: errMsg });
-    return { text: '', success: false, error: errMsg };
-  }
+  } catch (e) {}
 }
 
killedBy: ASR Service transcribeAudio should handle network error
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] StringLiteral
src/services/asr.service.ts:46:53
     info('ASR transcription completed', { textLength: text.length });
     return { text, success: true };
   } catch (e) {
-    const errMsg = e instanceof Error ? e.message : 'Unknown ASR error';
+    const errMsg = e instanceof Error ? e.message : "";
     error('ASR transcription failed', { error: errMsg });
     return { text: '', success: false, error: errMsg };
killedBy: ASR Service transcribeAudio should handle unknown error type
statusReason: expected '' to be 'Unknown ASR error' // Object.is equality

[Killed] BooleanLiteral
src/services/asr.service.ts:48:33
   } catch (e) {
     const errMsg = e instanceof Error ? e.message : 'Unknown ASR error';
     error('ASR transcription failed', { error: errMsg });
-    return { text: '', success: false, error: errMsg };
+    return { text: '', success: true, error: errMsg };
   }
 }
killedBy: ASR Service transcribeAudio should handle network error
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/asr.service.ts:52:44
   }
 }
 
-export function isASRConfigured(): boolean {
-  const apiKey = process.env.FUN_ASR_API_KEY;
-  return !!apiKey && apiKey !== 'your-fun-asr-api-key';
-}
+export function isASRConfigured(): boolean {}
 
killedBy: ASR Service isASRConfigured should return true when API key is configured
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/services/asr.service.ts:54:10
 
 export function isASRConfigured(): boolean {
   const apiKey = process.env.FUN_ASR_API_KEY;
-  return !!apiKey && apiKey !== 'your-fun-asr-api-key';
+  return !!apiKey || apiKey !== 'your-fun-asr-api-key';
 }
 
killedBy: ASR Service isASRConfigured should return false when API key is not set
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/asr.service.ts:54:10
 
 export function isASRConfigured(): boolean {
   const apiKey = process.env.FUN_ASR_API_KEY;
-  return !!apiKey && apiKey !== 'your-fun-asr-api-key';
+  return false;
 }
 
killedBy: ASR Service isASRConfigured should return true when API key is configured
statusReason: expected false to be true // Object.is equality
