[Survived] ObjectLiteral
src/utils/logger.ts:3:21
 import pino from 'pino';
 
-const logger = pino({
-  level: process.env.LOG_LEVEL || 'info',
-  transport:
-    process.env.NODE_ENV === 'development'
-      ? { target: 'pino-pretty', options: { colorize: true } }
-      : undefined,
-});
+const logger = pino({});
 
 export function info(message: string, meta?: Record<string, unknown>) {

[Killed] ConditionalExpression
src/utils/logger.ts:4:10
 import pino from 'pino';
 
 const logger = pino({
-  level: process.env.LOG_LEVEL || 'info',
+  level: true,
   transport:
     process.env.NODE_ENV === 'development'
killedBy: POST /webhook should return 401 when timestamp is missing; POST /webhook should return 401 when signature is missing; POST /webhook should return 401 when signature is invalid
statusReason: default level:true must be included in custom levels

[Killed] LogicalOperator
src/utils/logger.ts:4:10
 import pino from 'pino';
 
 const logger = pino({
-  level: process.env.LOG_LEVEL || 'info',
+  level: process.env.LOG_LEVEL && 'info',
   transport:
     process.env.NODE_ENV === 'development'
killedBy: POST /webhook should return 401 when timestamp is missing; POST /webhook should return 401 when signature is missing; POST /webhook should return 401 when signature is invalid
statusReason: default level:undefined must be included in custom levels

[Killed] ConditionalExpression
src/utils/logger.ts:6:5
 const logger = pino({
   level: process.env.LOG_LEVEL || 'info',
   transport:
-    process.env.NODE_ENV === 'development'
+    true
       ? { target: 'pino-pretty', options: { colorize: true } }
       : undefined,
killedBy: Admin Templates Routes - Extra Coverage GET /admin/templates — Templates listing page should return 200 with templates list
statusReason: expected 500 to be 200 // Object.is equality

[Survived] ConditionalExpression
src/utils/logger.ts:6:5
 const logger = pino({
   level: process.env.LOG_LEVEL || 'info',
   transport:
-    process.env.NODE_ENV === 'development'
+    false
       ? { target: 'pino-pretty', options: { colorize: true } }
       : undefined,

[NoCoverage] BooleanLiteral
src/utils/logger.ts:7:55
   level: process.env.LOG_LEVEL || 'info',
   transport:
     process.env.NODE_ENV === 'development'
-      ? { target: 'pino-pretty', options: { colorize: true } }
+      ? { target: 'pino-pretty', options: { colorize: false } }
       : undefined,
 });

[NoCoverage] ObjectLiteral
src/utils/logger.ts:7:9
   level: process.env.LOG_LEVEL || 'info',
   transport:
     process.env.NODE_ENV === 'development'
-      ? { target: 'pino-pretty', options: { colorize: true } }
+      ? {}
       : undefined,
 });

[Killed] BlockStatement
src/utils/logger.ts:11:71
       : undefined,
 });
 
-export function info(message: string, meta?: Record<string, unknown>) {
-  logger.info(meta, message);
-}
+export function info(message: string, meta?: Record<string, unknown>) {}
 
 export function warn(message: string, meta?: Record<string, unknown>) {
killedBy: Admin Templates Routes - Extra Coverage GET /admin/templates — Templates listing page should return 200 with templates list
statusReason: expected 500 to be 200 // Object.is equality

[Survived] BlockStatement
src/utils/logger.ts:15:71
   logger.info(meta, message);
 }
 
-export function warn(message: string, meta?: Record<string, unknown>) {
-  logger.warn(meta, message);
-}
+export function warn(message: string, meta?: Record<string, unknown>) {}
 
 export function error(message: string, meta?: Record<string, unknown>) {

[Survived] BlockStatement
src/utils/logger.ts:19:72
   logger.warn(meta, message);
 }
 
-export function error(message: string, meta?: Record<string, unknown>) {
-  logger.error(meta, message);
-}
+export function error(message: string, meta?: Record<string, unknown>) {}
 
 export function debug(message: string, meta?: Record<string, unknown>) {

[Survived] BlockStatement
src/utils/logger.ts:23:72
   logger.error(meta, message);
 }
 
-export function debug(message: string, meta?: Record<string, unknown>) {
-  logger.debug(meta, message);
-}
+export function debug(message: string, meta?: Record<string, unknown>) {}
 
 export { logger };
