[Killed] Regex
src/utils/pii-anonymizer.ts:2:18
 const PHONE_RE = /\b1[3-9]\d{9}\b/g;
-const EMAIL_RE = /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g;
+const EMAIL_RE = /[a-zA-Z0-9._%+-]+@[^a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g;
 const CHINESE_NAME_RE = /[\u4e00-\u9fa5]{2,4}(?:说|的|表示|反映|提到|认为|反馈|也同意)/g;
 
killedBy: PII Anonymization handles mixed PII
statusReason: expected '[匿名用户]邮箱wangwu@test.com和138****5678' not to contain 'wangwu@test.com'

[Survived] Regex
src/utils/pii-anonymizer.ts:2:18
 const PHONE_RE = /\b1[3-9]\d{9}\b/g;
-const EMAIL_RE = /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g;
+const EMAIL_RE = /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]/g;
 const CHINESE_NAME_RE = /[\u4e00-\u9fa5]{2,4}(?:说|的|表示|反映|提到|认为|反馈|也同意)/g;
 

[Killed] BlockStatement
src/utils/pii-anonymizer.ts:5:52
 const EMAIL_RE = /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g;
 const CHINESE_NAME_RE = /[\u4e00-\u9fa5]{2,4}(?:说|的|表示|反映|提到|认为|反馈|也同意)/g;
 
-export function anonymizePII(text: string): string {
-  if (!text) return '';
-  let result = text;
-  result = result.replace(PHONE_RE, (m) => `${m.slice(0, 3)}****${m.slice(7)}`);
-  result = result.replace(EMAIL_RE, '[邮箱]');
-  result = result.replace(CHINESE_NAME_RE, '[匿名用户]');
-  return result;
-}
+export function anonymizePII(text: string): string {}
 
killedBy: PII Anonymization anonymizes Chinese names in quotes
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BooleanLiteral
src/utils/pii-anonymizer.ts:6:7
 const CHINESE_NAME_RE = /[\u4e00-\u9fa5]{2,4}(?:说|的|表示|反映|提到|认为|反馈|也同意)/g;
 
 export function anonymizePII(text: string): string {
-  if (!text) return '';
+  if (text) return '';
   let result = text;
   result = result.replace(PHONE_RE, (m) => `${m.slice(0, 3)}****${m.slice(7)}`);
killedBy: PII Anonymization anonymizes Chinese names in quotes
statusReason: expected '' to contain '[匿名用户]'

[Killed] ConditionalExpression
src/utils/pii-anonymizer.ts:6:7
 const CHINESE_NAME_RE = /[\u4e00-\u9fa5]{2,4}(?:说|的|表示|反映|提到|认为|反馈|也同意)/g;
 
 export function anonymizePII(text: string): string {
-  if (!text) return '';
+  if (true) return '';
   let result = text;
   result = result.replace(PHONE_RE, (m) => `${m.slice(0, 3)}****${m.slice(7)}`);
killedBy: PII Anonymization anonymizes Chinese names in quotes
statusReason: expected '' to contain '[匿名用户]'

[Killed] ArrowFunction
src/utils/pii-anonymizer.ts:8:37
 export function anonymizePII(text: string): string {
   if (!text) return '';
   let result = text;
-  result = result.replace(PHONE_RE, (m) => `${m.slice(0, 3)}****${m.slice(7)}`);
+  result = result.replace(PHONE_RE, () => undefined);
   result = result.replace(EMAIL_RE, '[邮箱]');
   result = result.replace(CHINESE_NAME_RE, '[匿名用户]');
killedBy: PII Anonymization masks phone numbers
statusReason: expected '我的电话是undefined' to contain '138****5678'

[Killed] MethodExpression
src/utils/pii-anonymizer.ts:8:47
 export function anonymizePII(text: string): string {
   if (!text) return '';
   let result = text;
-  result = result.replace(PHONE_RE, (m) => `${m.slice(0, 3)}****${m.slice(7)}`);
+  result = result.replace(PHONE_RE, (m) => `${m}****${m.slice(7)}`);
   result = result.replace(EMAIL_RE, '[邮箱]');
   result = result.replace(CHINESE_NAME_RE, '[匿名用户]');
killedBy: PII Anonymization masks phone numbers
statusReason: expected '我的电话是13812345678****5678' to contain '138****5678'

[Survived] StringLiteral
src/utils/pii-anonymizer.ts:9:37
   if (!text) return '';
   let result = text;
   result = result.replace(PHONE_RE, (m) => `${m.slice(0, 3)}****${m.slice(7)}`);
-  result = result.replace(EMAIL_RE, '[邮箱]');
+  result = result.replace(EMAIL_RE, "");
   result = result.replace(CHINESE_NAME_RE, '[匿名用户]');
   return result;
